---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StringerCurveTooShort
source: html/3ab72175-e838-f6d3-691d-8e375a26b83a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StringerCurveTooShort Property

A piece of boundary is too short to create stringer on it.

## Syntax (C#)
```csharp
public static FailureDefinitionId StringerCurveTooShort { get; }
```